content-org/blog.org
#+title: Boyang Yan's Blog
#+hugo_base_dir: ~/blog/
#+hugo_section: posts
#+hugo_front_matter_format: yaml

** DONE Using Emacs Org-Babel Mode to Write Literate Programming Documents :babel:org:emacs:literate:programming:
CLOSED: [2021-12-17 Fri 10:29]
:PROPERTIES:
:EXPORT_FILE_NAME: orgBabel
:EXPORT_OPTIONS: author:nil
:ID:       44cd9edd-924b-49e1-8a91-5f85961165c4
:END:

*** Introduction
We introduce the use of emacs org-babel model in this document. Emacs Org-Babel mode is a literate programming tool (aka. active document), which can embed multiple programming languages, inlcuding R, Python, C/C++ in one document. Babel has ability to execute source code within Org-mode documents.

*** Pre-reading
1. [[id:93eddd5b-1e6c-4107-9c04-2d68968a01cc][Emacs/Getting Started Org-mode on Emacs]]

*** Source Code Insert & Running

Here is an format example:
#+begin_example
#+BEGIN_SRC language
#+END_SRC
#+end_example


*** Reference List
1. https://orgmode.org/worg/org-contrib/babel/languages/ob-doc-C.html
2. https://orgmode.org/worg/org-contrib/babel/languages/ob-doc-R.html
3. https://orgmode.org/worg/org-contrib/babel/how-to-use-Org-Babel-for-R.html


