content/posts/orgBabel.md
---
title: "Using Emacs Org-Babel Mode to Write Literate Programming Documents"
date: 2021-12-17T10:29:00+08:00
tags: ["babel", "org", "emacs", "literate", "programming"]
categories: ["Emacs"]
draft: false
---

## Introduction {#introduction}

We introduce the use of emacs org-babel model in this document. Emacs Org-Babel mode is a literate programming tool (aka. active document), which can embed multiple programming languages, inlcuding R, Python, C/C++ in one document. Babel has ability to execute source code within Org-mode documents.


## Pre-reading {#pre-reading}

1.  [Emacs/Getting Started Org-mode on Emacs]({{< relref "org-mode" >}})


## Source Code Insert &amp; Running {#source-code-insert-and-running}

Here is an format example:

```text
#+BEGIN_SRC language
#+END_SRC
```


## Reference List {#reference-list}

1.  <https://orgmode.org/worg/org-contrib/babel/languages/ob-doc-C.html>
2.  <https://orgmode.org/worg/org-contrib/babel/languages/ob-doc-R.html>
3.  <https://orgmode.org/worg/org-contrib/babel/how-to-use-Org-Babel-for-R.html>
